# BrokerInBlue House Price Predictor

### Importing Libraires

In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams['figure.figsize'] = (20,10)

### Loading Dataset

In [2]:
df1 = pd.read_csv('Bengaluru_House_Data.csv')
df1.sample(10)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
7506,Super built-up Area,Ready To Move,Banashankari Stage III,3 BHK,Pridsi,1305,2.0,1.0,59.00
8433,Super built-up Area,Ready To Move,7th Phase JP Nagar,2 BHK,Shncyes,1174,2.0,1.0,47.00
13006,Carpet Area,Ready To Move,Kereguddadahalli,3 BHK,Jaood G,1280,3.0,1.0,42.00
4973,Built-up Area,Ready To Move,Gubbalala,3 BHK,Names H,1539,2.0,2.0,52.36
138,Super built-up Area,18-May,Bommasandra Industrial Area,3 BHK,NaN,1280,3.0,1.0,50.40
4406,Super built-up Area,Ready To Move,Kodichikkanahalli,2 BHK,NaN,1070,2.0,3.0,43.00
6695,Super built-up Area,Ready To Move,Rajaji Nagar,3 BHK,PhestOn,2500,3.0,3.0,350.00
6589,Super built-up Area,18-Oct,Chennammana Kere,2 BHK,NaN,1145,2.0,2.0,58.40
7411,Super built-up Area,18-Apr,Thanisandra,2 BHK,Bhmesy,1265,2.0,1.0,83.00
2103,Plot Area,Ready To Move,Brookefield,4 Bedroom,NaN,1700,4.0,1.0,152.00

### Exploring and Cleaning Data

In [3]:
df1.shape

(13320, 9)

In [4]:
df1.describe()

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [5]:
df1.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [6]:
df2 = df1.drop(['area_type','availability','society'], axis='columns')

In [7]:
df2.sample(10)

             location       size   total_sqft  bath  balcony   price
10070      Seegehalli  3 Bedroom         2400   4.0      1.0  240.00
8783       Whitefield      3 BHK  1390 - 1600   NaN      NaN   60.55
9975         KR Puram      4 BHK         3628   4.0      1.0  246.00
7282     Bannerghatta      2 BHK         1100   2.0      1.0   66.00
296         TC Palaya  3 Bedroom         1475   3.0      1.0   98.00
12557     Hegde Nagar      3 BHK      2087.01   4.0      2.0  160.00
4224           Hebbal      3 BHK         1645   3.0      2.0  121.00
10003     Thanisandra      3 BHK         1241   2.0      1.0   65.00
9845    Akshaya Nagar  1 Bedroom         2000   1.0      0.0  200.00
6593   Chandra Layout  3 Bedroom          700   3.0      2.0  195.00

In [8]:
df2.shape

(13320, 6)

In [9]:
df2['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64

In [17]:
df2.isnull().sum()

location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [18]:
df3 = df2.dropna()

In [20]:
df3.shape

(12710, 6)

In [21]:
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
balcony       0
price         0
dtype: int64